In [92]:
from hossam import load_data
from pandas import pivot_table, melt
from pandas import DataFrame

# 학생 흡연율 데이터 전처리

In [5]:
# 학생 흡연율 데이터 전처리
smoke = load_data("students_smoke")
smoke

[data] https://data.hossam.kr/data/lab05/students_smoke.xlsx
[desc] 한 도시의 20개 중,고교를 대상으로 조사한 흡연율 자료 (인덱스와 메타데이터 없음)
[!] Cannot read metadata

    지역  구성   흡연율
0   도시   남  0.64
1   도시   여  0.45
2   농촌  공학  0.70
3   도시   남  0.85
4   농촌   남  0.72
5   도시   남  0.78
6   도시   여  0.62
7   도시   남  0.79
8   농촌   남  0.75
9   농촌  공학  0.81
10  농촌   여  0.56
11  도시   여  0.48
12  농촌   남  0.72
13  도시  공학  0.68
14  농촌   남  0.79
15  도시   남  0.90
16  농촌   여  0.34
17  도시   여  0.48
18  농촌   여  0.49
19  농촌  공학  0.76

In [11]:
p1 = pivot_table(smoke,
                 index='지역',
                 columns = '구성',
                 values = '흡연율')
print(type(p1))
p1

<class 'pandas.core.frame.DataFrame'>

구성        공학      남         여
지역
농촌  0.756667  0.745  0.463333
도시  0.680000  0.792  0.507500

In [55]:
# 도시와 농촌별에 따른 남여 평균 흡연율을 확인할 수 있는 데이터 피벗테이블
p2 = pivot_table(smoke,
                 index = '지역',
                 columns='구성',
                 values='흡연율',
                 aggfunc=['mean'])
p2

        mean
구성        공학      남         여
지역
농촌  0.756667  0.745  0.463333
도시  0.680000  0.792  0.507500

# 동네 아이스크림 가게 매출 분석 챌린지!

In [38]:
icecream = load_data("icecream_sales")
icecream

[data] https://data.hossam.kr/data/lab05/icecream_sales.xlsx
[desc] '달콤 스쿱' 아이스크림 가게의 매출 데이터 (인덱스 없음)

field     description
--------  -------------
Date      판매 날짜
Flavor    아이스크림 맛
Topping   추가된 토핑
Price     개당 가격
Quantity  판매 수량

         Date Flavor Topping  Price  Quantity
0  2023-07-01    초콜릿     아몬드   3500      20.0
1  2023-07-01    바닐라    초코시럽   3000      25.0
2  2023-07-01     딸기      연유   3200      18.0
3  2023-07-02   민트초코     초코칩   3800      15.0
4  2023-07-02    초콜릿     아몬드   3500      22.0
5  2023-07-02    바닐라     NaN   3000      30.0
6  2023-07-03     딸기      연유   3200      25.0
7  2023-07-03   민트초코     초코칩   3800       NaN
8  2023-07-03    바닐라    초코시럽   3000      28.0
9  2023-07-04    초콜릿     아몬드   3500      18.0
10 2023-07-04     딸기      연유   3200      22.0
11 2023-07-04   민트초코     초코칩   3800      17.0

In [67]:
# 1.구조,결측치 확인
row,cols = icecream.shape
print("%d행, %d열의 %d차원 데이터" % (row,cols,icecream.ndim)) 

icecream.info()

결측치 = icecream['Quantity'].isna().sum()
print("결측치는 총 %d개 입니다." % 결측치)
icecream=icecream.dropna(subset=['Topping'])
icecream = icecream.dropna(subset = ['Quantity'])
icecream

11행, 5열의 2차원 데이터
<class 'pandas.core.frame.DataFrame'>
Index: 11 entries, 0 to 11
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      11 non-null     datetime64[ns]
 1   Flavor    11 non-null     object
 2   Topping   10 non-null     object
 3   Price     11 non-null     int64
 4   Quantity  11 non-null     float64
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 528.0+ bytes
결측치는 총 0개 입니다.

         Date Flavor Topping  Price  Quantity
0  2023-07-01    초콜릿     아몬드   3500      20.0
1  2023-07-01    바닐라    초코시럽   3000      25.0
2  2023-07-01     딸기      연유   3200      18.0
3  2023-07-02   민트초코     초코칩   3800      15.0
4  2023-07-02    초콜릿     아몬드   3500      22.0
6  2023-07-03     딸기      연유   3200      25.0
8  2023-07-03    바닐라    초코시럽   3000      28.0
9  2023-07-04    초콜릿     아몬드   3500      18.0
10 2023-07-04     딸기      연유   3200      22.0
11 2023-07-04   민트초코     초코칩   3800      17.0

In [76]:
# 2.
icecream2 = icecream.dropna(subset=['Quantity'])
icecream2

         Date Flavor Topping  Price  Quantity
0  2023-07-01    초콜릿     아몬드   3500      20.0
1  2023-07-01    바닐라    초코시럽   3000      25.0
2  2023-07-01     딸기      연유   3200      18.0
3  2023-07-02   민트초코     초코칩   3800      15.0
4  2023-07-02    초콜릿     아몬드   3500      22.0
6  2023-07-03     딸기      연유   3200      25.0
8  2023-07-03    바닐라    초코시럽   3000      28.0
9  2023-07-04    초콜릿     아몬드   3500      18.0
10 2023-07-04     딸기      연유   3200      22.0
11 2023-07-04   민트초코     초코칩   3800      17.0

In [78]:
# 2.
icecream2 = pivot_table(icecream,
           index = 'Date',
           columns = 'Flavor', 
           values='Quantity',
           aggfunc = ['sum'])
icecream2

             sum
Flavor        딸기  민트초코   바닐라   초콜릿
Date
2023-07-01  18.0   NaN  25.0  20.0
2023-07-02   NaN  15.0   NaN  22.0
2023-07-03  25.0   NaN  28.0   NaN
2023-07-04  22.0  17.0   NaN  18.0

In [84]:
# 2.
icecream3 = icecream2.reset_index()
melt(icecream3, id_vars = ['Date'], value_vars=['딸기','민트초코','바닐라','초콜릿'],
     var_name = 'Flavor', value_name = 'Quantity')

KeyError: "The following id_vars or value_vars are not present in the DataFrame: ['Date', '딸기', '민트초코', '바닐라', '초콜릿']"

# 게임 토너먼트 최고 득점자를 찾아라!

In [121]:
# 1.
gs = load_data("game_scores")
gs

[data] https://data.hossam.kr/data/lab05/game_scores.xlsx
[desc] 최근 열린 게임 토너먼트 경기 결과 데이터 (인덱스와 메타데이터 없음)
[!] Cannot read metadata

    player  stage1  stage2  stage3
0    Alice      85    92.0    88.0
1      Bob      78     NaN    95.0
2  Charlie      90    88.0    91.0
3    David      82    85.0     NaN
4      Eva      95    98.0    99.0

In [ ]:
# 2.쌤
결측치확인 = gs['player'].isna().sum()
결측치확인
df1 = gs.dropna()
df1
df2 = df1.set_index('player')
df3 = DataFrame(df2.stack())
df3

                   0
player
Alice   stage1  85.0
        stage2  92.0
        stage3  88.0
Charlie stage1  90.0
        stage2  88.0
        stage3  91.0
Eva     stage1  95.0
        stage2  98.0
        stage3  99.0

In [130]:
# 2.쌤
df4 = df3.reset_index()
df4.filter(['player',0]).groupby('player').mean()

                 0
player
Alice    88.333333
Charlie  89.666667
Eva      97.333333

In [91]:
# 1.
gs1 = gs.stack()
print(type(gs1))
gs1

<class 'pandas.core.series.Series'>

0  player      Alice
   stage1         85
   stage2       92.0
   stage3       88.0
1  player        Bob
   stage1         78
   stage3       95.0
2  player    Charlie
   stage1         90
   stage2       88.0
   stage3       91.0
3  player      David
   stage1         82
   stage2       85.0
4  player        Eva
   stage1         95
   stage2       98.0
   stage3       99.0
dtype: object

In [94]:
# 1.
df1 = DataFrame(gs.stack())
df1

                0
0 player    Alice
  stage1       85
  stage2     92.0
  stage3     88.0
1 player      Bob
  stage1       78
  stage3     95.0
2 player  Charlie
  stage1       90
  stage2     88.0
  stage3     91.0
3 player    David
  stage1       82
  stage2     85.0
4 player      Eva
  stage1       95
  stage2     98.0
  stage3     99.0

In [120]:
# 3
gs1 = gs.copy()
gs1['avg'] = gs[['stage1','stage2','stage3']].mean(axis=1)
gs1 = gs1[['player','avg']]
gs1 = gs.set_index('player')
gs1

         stage1  stage2  stage3
player
Alice        85    92.0    88.0
Bob          78     NaN    95.0
Charlie      90    88.0    91.0
David        82    85.0     NaN
Eva          95    98.0    99.0

# 파생변수

# 우수 고객을 찾아라!= 영업 데이터 분석 챌린지

In [152]:
from hossam import load_data
from pandas import pivot_table, melt
from pandas import DataFrame

In [154]:
from hossam import load_data
import numpy as np

In [157]:
origin = load_data("grade")
origin

[data] https://data.hossam.kr/data/common/grade.xlsx
[desc] 어느 학급의 과목별 점수를 조사한 가상의 데이터

field    description
-------  -------------
이름     index
학년     int
성별     str
국어     int
영어     int
수학     int
과학     int

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80

In [159]:
df1=origin.copy()
df1['직접합계'] = df1['국어'] +df1['영어']+df1['수학']+df1['과학']
df1

    학년  성별  국어   영어  수학  과학  직접합계
이름
철수   1  남자  98   77  88  64   327
영희   2  여자  88  120  62  72   342
민철   1  남자  92   70  83  79   324
수현   3  여자  63   60  31  71   225
호영   4  남자  75   50  90  88   303
영호   4  남자  80   88  91  72   331
용식   2  남자  82   88  79  90   339
나영   1  여자  90   92  81  95   358
석영   1  남자  91   90  89  80   350

In [162]:
df2 = origin.copy()
df2['합계'] = df2[df2.columns[2:6]].sum(axis=1)
df2

    학년  성별  국어   영어  수학  과학   합계
이름
철수   1  남자  98   77  88  64  327
영희   2  여자  88  120  62  72  342
민철   1  남자  92   70  83  79  324
수현   3  여자  63   60  31  71  225
호영   4  남자  75   50  90  88  303
영호   4  남자  80   88  91  72  331
용식   2  남자  82   88  79  90  339
나영   1  여자  90   92  81  95  358
석영   1  남자  91   90  89  80  350

In [164]:
df3 = origin.copy()
df3['합계'] = df3.iloc[:,2:].sum(axis=1)
df3

    학년  성별  국어   영어  수학  과학   합계
이름
철수   1  남자  98   77  88  64  327
영희   2  여자  88  120  62  72  342
민철   1  남자  92   70  83  79  324
수현   3  여자  63   60  31  71  225
호영   4  남자  75   50  90  88  303
영호   4  남자  80   88  91  72  331
용식   2  남자  82   88  79  90  339
나영   1  여자  90   92  81  95  358
석영   1  남자  91   90  89  80  350

In [168]:
df3['평균'] = df3.iloc[:,2:6].mean(axis = 1)
df3['최댓값'] = df3.iloc[:,2:6].max(axis = 1)
df3['최솟값'] = df3.iloc[:,2:6].min(axis=1)
df3['표준편차'] = df3.iloc[:,2:6].std(axis=1)
df3['분산'] = df3.iloc[:,2:6].var(axis=1)
df3

    학년  성별  국어   영어  수학  과학   합계     평균  최댓값  최솟값       표준편차          분산
이름
철수   1  남자  98   77  88  64  327  81.75   98   64  14.614491  213.583333
영희   2  여자  88  120  62  72  342  85.50  120   62  25.370587  643.666667
민철   1  남자  92   70  83  79  324  81.00   92   70   9.128709   83.333333
수현   3  여자  63   60  31  71  225  56.25   71   31  17.461863  304.916667
호영   4  남자  75   50  90  88  303  75.75   90   50  18.409689  338.916667
영호   4  남자  80   88  91  72  331  82.75   91   72   8.539126   72.916667
용식   2  남자  82   88  79  90  339  84.75   90   79   5.123475   26.250000
나영   1  여자  90   92  81  95  358  89.50   95   81   6.027714   36.333333
석영   1  남자  91   90  89  80  350  87.50   91   80   5.066228   25.666667

In [171]:
df4 = origin.copy()
df4['합계'] = df4.iloc[:,2:6].sum(axis=1)
df4['평균'] = df4.iloc[:,2:6].mean(axis=1)
df4

    학년  성별  국어   영어  수학  과학   합계     평균
이름
철수   1  남자  98   77  88  64  327  81.75
영희   2  여자  88  120  62  72  342  85.50
민철   1  남자  92   70  83  79  324  81.00
수현   3  여자  63   60  31  71  225  56.25
호영   4  남자  75   50  90  88  303  75.75
영호   4  남자  80   88  91  72  331  82.75
용식   2  남자  82   88  79  90  339  84.75
나영   1  여자  90   92  81  95  358  89.50
석영   1  남자  91   90  89  80  350  87.50

In [174]:
df4['결과1'] = np.where(df4['평균'] >= 80, '합격','불합격')
df4

    학년  성별  국어   영어  수학  과학   합계     평균  결과1
이름
철수   1  남자  98   77  88  64  327  81.75   합격
영희   2  여자  88  120  62  72  342  85.50   합격
민철   1  남자  92   70  83  79  324  81.00   합격
수현   3  여자  63   60  31  71  225  56.25  불합격
호영   4  남자  75   50  90  88  303  75.75  불합격
영호   4  남자  80   88  91  72  331  82.75   합격
용식   2  남자  82   88  79  90  339  84.75   합격
나영   1  여자  90   92  81  95  358  89.50   합격
석영   1  남자  91   90  89  80  350  87.50   합격

In [195]:
df4['결과2']='불합격'
df4.loc[df4['평균']>=80, "결과2"] = '합격'
df4

    학년  성별  국어   영어  수학  과학   합계     평균  결과1  결과2
이름
철수   1  남자  98   77  88  64  327  81.75   합격   합격
영희   2  여자  88  120  62  72  342  85.50   합격   합격
민철   1  남자  92   70  83  79  324  81.00   합격   합격
수현   3  여자  63   60  31  71  225  56.25  불합격  불합격
호영   4  남자  75   50  90  88  303  75.75  불합격  불합격
영호   4  남자  80   88  91  72  331  82.75   합격   합격
용식   2  남자  82   88  79  90  339  84.75   합격   합격
나영   1  여자  90   92  81  95  358  89.50   합격   합격
석영   1  남자  91   90  89  80  350  87.50   합격   합격

In [197]:
conditions= [
    (df4['평균'] >= 90),
    (df4['평균'] >= 80),
    (df4['평균'] >= 70)
]

value = ['A','B','C']

df4['학점'] = np.select(conditions, value, default = 'F')
df4

    학년  성별  국어   영어  수학  과학   합계     평균  결과1  결과2 학점
이름
철수   1  남자  98   77  88  64  327  81.75   합격   합격  B
영희   2  여자  88  120  62  72  342  85.50   합격   합격  B
민철   1  남자  92   70  83  79  324  81.00   합격   합격  B
수현   3  여자  63   60  31  71  225  56.25  불합격  불합격  F
호영   4  남자  75   50  90  88  303  75.75  불합격  불합격  C
영호   4  남자  80   88  91  72  331  82.75   합격   합격  B
용식   2  남자  82   88  79  90  339  84.75   합격   합격  B
나영   1  여자  90   92  81  95  358  89.50   합격   합격  B
석영   1  남자  91   90  89  80  350  87.50   합격   합격  B

In [202]:
def getScore(x):
    if x >= 90:
        score = 'A'
    elif x >= 80:
        score = 'B'
    elif x >=70:
        score = 'C'

    else:
        score = 'F'

    return score

In [204]:
df4['학점'] = df4['평균'].apply(getScore)
df4

    학년  성별  국어   영어  수학  과학   합계     평균  결과1  결과2 학점
이름
철수   1  남자  98   77  88  64  327  81.75   합격   합격  B
영희   2  여자  88  120  62  72  342  85.50   합격   합격  B
민철   1  남자  92   70  83  79  324  81.00   합격   합격  B
수현   3  여자  63   60  31  71  225  56.25  불합격  불합격  F
호영   4  남자  75   50  90  88  303  75.75  불합격  불합격  C
영호   4  남자  80   88  91  72  331  82.75   합격   합격  B
용식   2  남자  82   88  79  90  339  84.75   합격   합격  B
나영   1  여자  90   92  81  95  358  89.50   합격   합격  B
석영   1  남자  91   90  89  80  350  87.50   합격   합격  B

In [206]:
df4['학점'] = df4['평균'].apply(
    lambda x:{10:'A', 8:'B', 7:'C'}.get(x//10,"F"))

df4

    학년  성별  국어   영어  수학  과학   합계     평균  결과1  결과2 학점
이름
철수   1  남자  98   77  88  64  327  81.75   합격   합격  B
영희   2  여자  88  120  62  72  342  85.50   합격   합격  B
민철   1  남자  92   70  83  79  324  81.00   합격   합격  B
수현   3  여자  63   60  31  71  225  56.25  불합격  불합격  F
호영   4  남자  75   50  90  88  303  75.75  불합격  불합격  C
영호   4  남자  80   88  91  72  331  82.75   합격   합격  B
용식   2  남자  82   88  79  90  339  84.75   합격   합격  B
나영   1  여자  90   92  81  95  358  89.50   합격   합격  B
석영   1  남자  91   90  89  80  350  87.50   합격   합격  B

In [208]:
df4['성별코드'] = df4['성별'].map({'남자':'M','여자':'F'})
df4

    학년  성별  국어   영어  수학  과학   합계     평균  결과1  결과2 학점 성별코드
이름
철수   1  남자  98   77  88  64  327  81.75   합격   합격  B    M
영희   2  여자  88  120  62  72  342  85.50   합격   합격  B    F
민철   1  남자  92   70  83  79  324  81.00   합격   합격  B    M
수현   3  여자  63   60  31  71  225  56.25  불합격  불합격  F    F
호영   4  남자  75   50  90  88  303  75.75  불합격  불합격  C    M
영호   4  남자  80   88  91  72  331  82.75   합격   합격  B    M
용식   2  남자  82   88  79  90  339  84.75   합격   합격  B    M
나영   1  여자  90   92  81  95  358  89.50   합격   합격  B    F
석영   1  남자  91   90  89  80  350  87.50   합격   합격  B    M

In [201]:
oss = load_data("online_shop_sales")
oss

[data] https://data.hossam.kr/data/lab05/online_shop_sales.xlsx
[desc] 우수 고객을 찾아라! - 영업 데이터 분석 챌린지

field      description
---------  ----------------
OrderID    주문번호(인덱스)
UserID     고객아이디
Product    상품
Price      가격
Quantity   주문수량
OrderDate  주문일

         UserID          Product  Price  Quantity  OrderDate
OrderID
1          1001           Laptop   1200         1 2024-10-01
2          1002            Mouse     25         2 2024-10-01
3          1001         Keyboard     75         1 2024-10-02
4          1003          Monitor    300         1 2024-10-03
5          1002           Webcam     50         1 2024-10-04
6          1003       HDMI Cable     15         3 2024-10-05
7          1001          USB Hub     30         2 2024-10-06
8          1004           Laptop   1300         1 2024-10-07
9          1002            Mouse     25         1 2024-10-08
10         1003          Monitor    300         2 2024-10-09
11         1001     External SSD    150         1 2024-10-10
12         1004  Docking Station    250         1 2024-10-11
13         1002         Keyboard     80         1 2024-10-12
14         1003           Webcam     55         1 2024-10-13
15         1001            Mouse     28         1 2024-10-14

In [221]:
# 1.
oss['Total']=oss['Price']*oss['Quantity']
df1 = oss.copy()
df2 = df1.filter(['UserID', 'Total']).groupby('UserID').sum()
df2

        Total
UserID
1001     1513
1002      205
1003     1000
1004     1550

In [224]:
df2.sort_values('Total', ascending = False).head(2)

        Total
UserID
1004     1550
1001     1513